// sam smith 2018-08-09 17:31:56
// 功能 ： 
//	  起因：小学时候有一篇课外阅读课文，内容大致是将一队旅行者在沙漠中行走很久，
//			当他们遇到一排沙漠中的椰枣树时，如同遇到生命的绿洲，
//			受此文章影响，我觉得在枯燥的海量代码、各式结构逻辑中学习工作中，
//			我们也应当设置一些暂居点（也可以称之为安居点、难民营、）
//			以帮助人们回忆起生命的希望，辅助人们寻蹈理想路线。
//       
//	  函数功能： 打印一排椰枣树：


#include <iostream>
#include <stdlib.h>

using namespace std;

int main()
{
	string str[10];
	str[0] = "----------------------------------------------------------------"
	str[1] = "-															    -"	
	str[2] = "-						 //									    -"
	str[3] = "-					||||//										    -"
	str[4] = "-					||||										    -"
    str[5] = "-				////||||\\\\								    -"  			
	str[6] = "----------------------------------------------------------------";
	str[7] = "----------------------------------------------------------------";



	return 0;
}